/*
一个正整数如果等于组成它的各位数字的阶乘之和，该整数称为阶乘和数。

例如，145=1!+4!+5!，则145是一个三位阶乘和数。

请输出所有阶乘和数（不会超过十万）
*/

#include <stdio.h>
#include <stdlib.h>

int b[10] = {1, 1, 2, 6, 24, 120, 720, 5040, 40320, 362880};//提前将10以内的阶乘存在数组，避免重复计算。
int main()
{
    int x, sum = 0, a;
    for (int j = 1; j <= 100000; j++)
    {
        sum = 0;
        a = j;
        while (j != 0)
        {
            x = j % 10;//让x等于最后一位数
            j /= 10;//去掉j最后一位数
            sum += b[x];//sum储存：自身的值+本次循环最后一位的阶乘 当j=0时，循环结束。
        }
        j = a;
        if (sum == a)
        {
            printf("%d ", j);
        }
    }
    printf("\n");
    system("pause");
    return 0;
}